In [21]:
import pandas as pd
import numpy as np

In [22]:
df = pd.read_csv("C:/Users/kunal/Downloads/internship-test2-master/internship-test2-master/input/question-2/main.csv")

In [24]:
df.head()

   user_id  age gender  occupation zip_code
0        1   24      M  technician    85711
1        2   53      F       other    94043
2        3   23      M      writer    32067
3        4   24      M  technician    43537
4        5   33      F       other    15213

In [29]:
df = df[['occupation','age']]
df_min = df.groupby(['occupation']).min()
df_max = df.groupby(['occupation']).max()

frames = pd.concat([df_min,df_max],axis=1)
print(frames)
frames.to_csv('Q.2_reult')

               age  age
occupation
administrator   21   70
artist          19   48
doctor          28   64
educator        23   63
engineer        22   70
entertainment   15   50
executive       22   69
healthcare      22   62
homemaker       20   50
lawyer          21   53
librarian       23   69
marketing       24   55
none            11   55
other           13   64
programmer      20   63
retired         51   73
salesman        18   66
scientist       23   55
student          7   42
technician      21   55
writer          18   60